<?php
mb_language("uni");
mb_internal_encoding("utf-8");


//-----------------------↓管理者へ送信↓---------------------------------//

//サイト名
$siteName="有限会社 伊豆葬祭";


//件名
$subject = "「".$siteName."」のWEBサイトからお問い合わせがありました";

//その他情報
//管理者メールアドレス(宛先)
$to = "info@izusousai.co.jp";

//サイトURL
$webSite ="https://www.izusousai.co.jp";


//クライアントの連絡先
$siteTEL="0557-95-3700";


//差出人メールアドレス格納
$header = "From: ". $mail;





//本文格納
$body ="【".$siteName."】"."\n";
$body .="　"."\n";
$body .= $name ."様よりお問い合わせがありましたので、ご担当者様は返信をお願いいたします。\n";
$body .= "\n";
$body .= "\n";
$body .= "-------------------------------------------\n";
$body .= "■お名前：" . $name ."\n";
$body .= "■フリガナ：" . $furi ."\n";
$body .= "■住所：" . $address ."\n";
$body .= "■電話番号：" . $phone ."\n";
$body .= "■メールアドレス：" . $mail ."\n";
$body .= "■ご希望の連絡方法：" . $method ."\n";
$body .= "■お問い合わせ内容："."\n".$msg1."\n";

$body .= "-------------------------------------------\n";
$body .= "\n";
$body .= "送信元WEBサイト：".$webSite."\n";
$body .= "送信者のIPアドレス：".$_SERVER["REMOTE_ADDR"]."\n";
$body .= "送信者のホスト名：".getHostByAddr(getenv('REMOTE_ADDR'))."\n";


mb_send_mail($to,$subject,$body,$header);

//-----------------------↑管理者へ送信↑---------------------------------//



//-----------------------↓送信者へ自動送信↓---------------------------------//

//件名
$subject2 = "お問合わせ確認メール";
//送信者メールアドレス(宛先)
$to2 = $mail;

//差出人メールアドレス格納
$header2 = "From: ". $mail;

$body2="==================================================================\n";
$body2 .="このメールは、自動的に送信されています。\n";
$body2 .="==================================================================\n";
$body2 .= "\n";
$body2 .= "\n";
$body2 .= "お問合わせ頂き、誠にありがとうございます。\n";
$body2 .= "内容を確認のうえ、担当者よりご返信させていただきますので、\n";
$body2 .= "今しばらくお待ちください。\n";
$body2 .= "\n";
$body2 .= "\n";
$body2 .= "-------------------------------------------\n";
$body2 .= "■お名前：" . $name ."\n";
$body2 .= "■フリガナ：" . $furi ."\n";
$body2 .= "■住所：" . $address ."\n";
$body2 .= "■電話番号：" . $phone ."\n";
$body2 .= "■メールアドレス：" . $mail ."\n";
$body2 .= "■ご希望の連絡方法：" . $method ."\n";
$body2 .= "■お問い合わせ内容："."\n".$msg1."\n";
$body2 .= "-------------------------------------------\n";
$body2 .= "\n";
$body2 .= "\n";
$body2 .= "\n";
$body2 .= "┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛\n"; 
$body2 .= "\n";
$body2 .= "　".$siteName."\n";
$body2 .= "\n";
$body2 .= "　URL：".$webSite."\n";
$body2 .= "\n";
$body2 .= "　TEL：".$siteTEL."\n";
$body2 .= "\n";
$body2 .= "┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛┛\n"; 

mb_send_mail($to2,$subject2,$body2,$header2);

//-----------------------↑送信者へ自動送信↑---------------------------------//

?>